1) /Users/lucaaresu/progetti/Symfony/cena-con-delitto/src/CenaConDelitto/Login/Controller/LoginController.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Component\Routing\Annotation\Route;
 class LoginController extends AbstractController
 {
-    #[Route('/login', name: 'login_page', methods: 'GET')]
-    public function login() : Response
+    protected function login() : Response
     {
         return $this->render('login.html.twig');
     }
 }
